NUMBER_OF_NAME = {
    1: 'Яркая личность, которой важно находиться в центре внимания. '
    'Такому человеку категорически запрещено находиться в толпе, важно быть '
    'лидером. Если вы растете в материальном, духовном и '
    'социальном плане, значит, идете по верному пути. Старайтесь развивать '
    'навыки дипломатии и коммуникабельность. \n Кармический урок: копите '
    'негатив внутри себя, никому не рассказываете, считаете, что справитесь '
    'сами. Решение - научитесь делиться с людьми своими переживаниями. \n'
    'Подходящие виды деятельности: медицина, политика, государственная служба, '
    'наука, авиация, инженерия, машиностроение, горное дело.',
    2: 'Как правило, человек такой находится в балансе между внешним и '
    'внутренним миром. Умеет ладить с людьми и находить компромиссы, придает '
    'большее значение духовным, а не материальным благам. Ваши сильные '
    'стороны - трудолюбие, настойчивость и терпение. Если их нет, то '
    'развивайте скорее. \n Кармический урок: думаете обо всех проблемах сразу, '
    'хватаетесь за тысячу дел одновременно, тревожитесь. Решение - решайте '
    'проблемы по мере поступления и не накапливайте их. \n Подходящие виды '
    'деятельности: финансы, сотрудник архива или библиотеки, сфера торговли, '
    'моды, сельского хозяйства, производства продуктов питания.',
    3: 'Двойственная натура, очень творческая, но ей необходимо найти '
    'единомышленников, чтобы здраво существовать в мире и достигать вершин. '
    'В одиночку не справляется, всегда нужна поддержка. Вы легко можете быть '
    'руководителем и лидером, но важно научиться правильно налаживать '
    'контакты. \n Кармический урок: считаете, что должны контролировать все, '
    'что происходит, разрываетесь на части, занимаетесь самокопанием и '
    'поиском проблем. Решение - учитесь расслабляться и отпускать контроль '
    'над ситуациями. \n Подходящие виды деятельности: поэт, литератор, '
    'художник, дипломат, бизнесмен, журналист, режиссер, музыкант, танцор, '
    'путешественник или ремесленник.',
    4: 'Главное для такого человека - это семья, сведения о предках, история '
    'рода. Он очень трепетно относится к своим близким, часто эмоционально '
    'зависим от родителей или друзей. Ему трудно жить в несправедливом мире, '
    'но необходимо научиться чтить традиции и отвечать не только за себя, но '
    'и за других людей. \n Кармический урок: болезненно реагируете, если '
    'что-то идет не по плану, к тому же, склонны поддаваться лени. Решение - '
    'воспитывайте себя, улучшайте дисциплину, а также не завышайте важность '
    'происходящего. \n Подходящие виды деятельности: историки, археологи, '
    'музейное дело, гостиничный или ресторанный бизнес, архитектура, '
    'реставрация, химия, производство продуктов.',
    5: 'Творческие люди, очень любят детей и процесс обучения. Наряду с этим, '
    'часто рискуют, азартные, могут плести интриги ради достижения своих '
    'целей. Именно это качество и советуют развивать - не бойтесь идти '
    '"ва-банк" и ставить на карту абсолютно все, хотя и с умом, конечно. '
    'Пока вы держитесь за старое - новое к вам не придет. \n Кармический урок: '
    'часто идете на уступки другим людям в ущерб своим интересам, думаете о '
    'других больше, чем о себе. Решение - повышайте самооценку и учитесь '
    'слышать себя. \n Подходящие виды деятельности: ювелир, оружейный мастер, '
    'кардио- или пластический хирург, стоматолог, реставратор антикварных или '
    'других вещей, телеведущий, руководитель, оператор, актер.',
    6: 'У обладателей данного жизненного кода очень тяжелая карма. Как '
    'правило, за ними тянется шлейф грехов их предков, которые нужно '
    'отрабатывать. Единственный выход - смириться и практиковать терпимость. '
    'Не завышайте важность чего бы то ни было в вашей жизни и окрашивайте все '
    'происходящее в яркие приятные цвета. \n Кармический урок: любите доводить '
    'все до идеала, важно, чтобы мир работал, "как часы", очень '
    'расстраиваетесь, если так не происходит. Решение - перестаньте '
    'подстраивать мир под себя и помните, что все происходит так, как должно. '
    '\n Подходящие виды деятельности: философия, аналитика, исследовательская '
    'деятельность, экономика, физика, биология, математика, политика, '
    'фармацевтика, военное дело.',
    7: 'Кармическая задача "семерок" - найти общий язык с любым человеком, '
    'научиться создавать благоприятную обстановку в любых условиях. Важно '
    'избавиться от эгоцентризма и понять, что цель вашей жизни - '
    'нечто большее, чем вечная гонка в попытке победить и превзойти всех. \n'
    'Кармический урок: любите свое одиночество, ни с кем не делитесь, потому '
    'что считаете, что вас никто не поймет, а проблемы у людей не такие '
    'масштабные, как у вас. Решение - займитесь духовными практиками и '
    'поймите, что проблемы в жизни есть у каждого, а сравнивать их глупо.\n'
    'Подходящие виды деятельности: преподавательская деятельность, '
    'юриспруденция, адвокатура, судебное дело, правоохранительные органы, '
    'руководящая должность.',
    8: 'Скорее всего, ваш жизненный путь не окажется ровным и гладким - '
    'обстоятельства будут постоянно меняться. Учитесь быстро ориентироваться '
    'по ситуации, быстро принимать решения, быстро реагировать на внешние '
    'факторы. При этом, помните, что ответственность за принятые решения '
    'несете только вы.\n Кармический урок: активно решаете чужие задачи, зато '
    'свои бесконечно откладываете или совершаете ошибки, о которых жалеете. '
    'Решение - смотрите на свои неудачи со стороны и не преувеличивайте их '
    'значение. \n Подходящие виды деятельности: шофер, альпинист, испытатель, '
    'пожарный, спасатель, психиатр, врач "скорой помощи", сотрудник секретной '
    'службы, цензор.',
    9: 'Высокодуховные люди, обладающие огромным потенциалом к '
    'наставничеству. Если жизненный путь выбран правильно, то вы приедете к '
    'традициям рода, вере или религии и станете учителем для многих. Изучайте '
    'различные культуры, практикуйте знания и открывайте для себя новые '
    'вершины.\n Кармический урок: часто переживаете за других, пытаетесь '
    'решать их проблемы, плохо спите из-за своих мыслей. Решение - '
    'перестаньте терзать себя и научитесь расслабляться.\n Подходящие виды '
    'деятельности: философия, культурология, социология, пропаганда, '
    'преподавание, религиозная и общественная деятельность.'
}

VALUE_OF_LETTER = dict(
    а=1, б=2, в=3, г=4, д=5, е=6, ё=7, ж=8, з=9, и=1, й=2, к=3, л=4, м=5,
    н=6, о=7, п=8, р=9, с=1, т=2, у=3, ф=4, х=5, ц=6, ч=7, ш=8, щ=9, ъ=1,
    ы=2, ь=3, э=4, ю=5, я=6
)

TIMES = [
    'давнее прошлое (год - полгода назад)', 
    'недавнее прошлое (до полугода назад)', 'настоящее',
    'близжайшее будущее (в течение полгода)',
    'отдалённое будущее (от полгода до года)', 'чем сердце успокоется'
]

DAY_OF_WEEK = {
    0: 'Понедельник! Это люди с тонкой душевной организацией. '
    'Они нежные и чувствительные, их легко задеть и обидеть, в их душе бурлит '
    'целый океан чувств и переживаний, в котором легко утонуть. У них развитый '
    'эмоциональный интеллект, что не всегда играет таким детям и взрослым на '
    'руку — они все происходящее пропускают через свое сердце, что плохо '
    'сказывается на их психическом и физическом здоровье. Такие люди часто '
    'посвящают свою жизнь оказанию помощи другим и благотворительности, '
    'становятся «лекарями» чужих душ. Луна — планета с отрицательной энергией, '
    'так что люди понедельника всю жизнь собирают ее, но жить, видя вокруг '
    'страдания других людей, им очень сложно. Страдания других проходят через '
    'них самих, оставляя неизгладимый след. Если «лунный» человек не научится '
    'черпать энергию из разных источников, то совсем скоро истощит свой запас, '
    'помогая и сопереживая другим, что приведет к проблемам со здоровьем. '
    'Ему надо учиться не копить в себе отрицательную энергетику, жить '
    'настоящим, не «пережевывать» прошлое и не переживать о будущем. Луна — '
    'покровительница дома и семьи, так что «лунным» людям надо почаще бывать '
    'дома, в кругу родных и близких.',

    1: 'Вторник! Характер во многом напоминает воинственного покровителя: они '
    'обожают скорость, это смелые и решительные люди, честолюбивые. Такие люди '
    'живут на огромной скорости, в их жизни происходит много событий, они '
    'находятся в потоке информации и действий. Они многого добиваются еще в '
    'молодости, многие из них занимают руководящие посты и создают семью в '
    'годы, когда другие об этом даже не помышляют. Но с годами начинают '
    'понимать, что инициатива наказуема, лучше сначала думать, а потом делать, '
    'и, вообще, в народе не зря говорили: «Семь раз отмерь — один отрежь». '
    '«Марсиане» любят ставить перед собой недостижимые цели, часто идут к '
    'своей цели напролом, не замечая препятствий. Для них цель — это не просто '
    'какая-то награда, а цель в жизни, ради которой они вскакивают с постели '
    'по утрам и готовы работать 24/7. Их главная ошибка — импульсивность, '
    'неумение доводить начатое до конца, если цель теряет актуальность. Марс '
    '— мужская планета, так что даже женщины, которые родились во вторник, '
    'любят мужские «игрушки»: спорт, автомобили, стрельбу и прочее. Чаще '
    'всего «марсиане» выбирают работу, связанную с риском, к примеру, службу '
    'в армии, или управлением людьми.',

    2: 'Среду! Мужчины и женщины, рожденные в среду, находятся под крылышком '
    'планеты торговли и коммуникации. «Меркурианцы» — настоящие счастливчики, '
    'ведь Меркурий — планета юности и легкости, и ее «подопечные», независимо '
    'от возраста, прекрасно себя чувствуют и ведут активный образ жизни до '
    'почтенной старости. Они легко заводят контакты, у них прекрасный контакт '
    'с братьями и сестрами, даже лучше, чем с родителями, у них много друзей. '
    '«Меркурианцы» — непоседы, которые обожают путешествия и поездки, им надо '
    'быть в постоянном потоке новой информации. Общение и перемены им нужны, '
    'как вода для цветка, иначе они завянут, впадут в тоску и печаль. Рождение '
    'ребенка в среду обязывает родителей стать самыми подвижными и '
    'любознательными в мире, чтобы обеспечить достойные условия воспитания '
    'малыша. Меркурий — покровитель свободы, так что не может быть и речь о '
    'каких-то ограничениях, в том числе со стороны любимого человека. Люди, '
    'которые родились в среду, не понимают слова «Нет!», запрет просто '
    'провоцирует их на то, чтобы пойти против воли человека, который его '
    'установил. Из «меркурианцев» получаются отличные политики, журналисты, '
    'писатели, торговцы, бизнесмены. Они хитрые и ловкие, легко заводят и '
    'поддерживают полезные контакты, у них с юных лет развита коммерческая '
    'жилка.',

    3: 'Четверг! Парни и девушки, рожденные в четверг — настоящие '
    'счастливчики. Все дело в том, что им покровительствует Юпитер, который '
    'астрологи за глаза называют «планетой большого счастья». Если коротко, '
    'то планета покровительствует крупным проектам, так что «юпитерианцы» '
    'ставят перед собой глобальные цели и идут к ним семимильными шагами, ни '
    'на минуту не сворачивая с дороги. Если кто-то в детстве мечтает стать '
    'пожарным или моделью, то «юпитерианцы» — начальником пожарной части или '
    'топ-моделью. Но в этой бочке меда есть и ложка дегтя, ведь «юпитерианцы» '
    'склонны все преувеличивать, в том числе и свои возможности. Эти люди '
    'способны из мухи сделать слона и раздуть на пустом месте проблему '
    'мирового масштаба. Они хватаются за грандиозные цели, но нередко бросают '
    'их на полпути из-за того, что этот пирог оказался им не по зубам. Но '
    'несмотря на это, чаще всего их судьба складывается самым прекрасным '
    'образом благодаря влиянию дня недели, за который отвечает Юпитер. '
    'Юпитер — планета влиятельных персон, так что в жизни «юпитерианцев» '
    'многое будет зависеть от благосклонности важных чинов. А еще у них будут '
    'явные проблемы с личной жизнью из-за того, что за своими глобальными '
    'проектами они напрочь забудут о своем сердце и у них просто не будет сил '
    'на то, чтобы создать семью.',

    4: 'Пятницу! Женщины и мужчины, рожденные в пятницу, живут под крылышком '
    'Венеры. Планета наделила их непростыми чертами характера — такие люди '
    'любят комфорт и красоту, они не могут жить в тоске и печали, им важно '
    'получать удовольствие от всего, что они делают в своей жизни. Если им '
    'холодно и голодно, ни о каком счастье и продуктивности и речи быть не '
    'может, ведь «венерианцы» очень зависимы от внешних условий. Это '
    'чувственные натуры, которые не могут работать там, где им не нравится, '
    'им трудно общаться с неприятными людьми, быть в окружении, которое им '
    'неприятно. Для них красота, удовольствие и чувства имеют прямо-таки '
    'магическое значение. Именно по этой причине им надо много внимания '
    'уделять себе любимым (спорт, диета, стиль и прочее), чтобы чувствовать '
    'себя на высоте. Только тот «венерианец» достигнет успеха в жизни, который '
    'уверен в себе, а без красоты тела и души этой уверенности у него попросту '
    'не будет. Венера также отвечает за деньги, поэтому у людей, которые '
    'находятся под ее покровительством, всегда должны быть деньги, иначе они '
    'будут несчастными. Венера — женская планета, так что ее «подопечные» '
    'легко находят общий язык с прекрасным полом, а женщины, как магнит, '
    'притягивают к себе мужчин.',

    5: 'Субботу! Сам по себе Сатурн — непростая планета, она отвечает за '
    'испытания и ограничения, так что нельзя назвать жизнь «сатурнианца» '
    'простой. Покровительница будет подсыпать ему щедрой рукой испытания, '
    'маленькие и не очень, на протяжении всей его жизни, так что остается '
    'себя только утешать тем, что в огне закаляется сталь. Сопротивляться этим '
    'испытаниям нет смысла, скорее всего, их придется нести, как крест до '
    'старости лет. Большинство «сатурнианцев» воспринимают жизнь, как тяжкое '
    'испытание, тяжелый крест, где нет места любви, счастью и наслаждению. '
    'Их жизнь складывается непросто с самого рождения, с пеленок они живут в '
    'каких-то рамках и ограничениях. Лучшее, что они могут сделать для себя и '
    'своих близких — научиться философски относиться ко всему, что происходит, '
    'и не принимать все близко к сердцу. Им надо учиться быть стойкими как в '
    'психологическом, так и физическом плане, чтобы отражать удары судьбы. '
    'Суровый характер «сатурнианца» отталкивает от него многих людей, но без '
    'него он просто сломается. Многие из них трудоголики, которые способны '
    'работать 24/7 на любой работе, лишь бы достигнуть поставленных перед '
    'собой целей. Сатурн — планета начальников и для «сатурнианцев» важны '
    'нормальные отношения с папой, начальством.',

    6: 'Воскресение! Это солнечные люди, творческие личности, у них отличные '
    'организаторские способности, они созидают, у них в голове всегда полно '
    'гениальных идей, которые они готовы воплотить в жизнь. С таким людьми '
    'весело и комфортно, они хорошие организаторы, но у них лучше получается '
    'вдохновлять и наставлять, чем делать что-то своими руками. В своем худшем '
    'проявлении люди, которые родились в последний день недели, живут в своих '
    'мечтах и ничего не делают для того, чтобы эти мечты стали реальностью. '
    'У них нет практической жилки, зато полным-полно творческих талантов — '
    'среди таких людей много известных художников, музыкантов, актеров. Они '
    'оптимисты, что бы ни случилось в жизни, всегда верят в то, что все, что '
    'ни случается — все к лучшему. Солнце — планета роскоши, так что часто '
    'такие люди предпочитают дорого и красиво жить, но сами вряд ли способны '
    'обеспечить себе такой уровень жизни. Они благородные и щедрые, повсюду, '
    'где они появляются, они несут свет и счастье. Тяжело переносят '
    'одиночество, им надо быть в окружении людей, с которыми они смогут '
    'общаться и дарить им позитивные эмоции.'
}

DECK_OF_CARDS = [

# черви hearts

    {'name': 'ace_of_hearts', 'title': 'Большая радость',
     'meaning': 'Туз Черви',
     'suit': 'hearts',
     'gween_of_hearts': 'разделённая любовь',
     'jack_of_hearts': 'разделённая любовь',
     'hearts': 'успех в любви',
     'clubs': 'неожиданный подарок',
     'diamonds': 'успех в делах',
     'ace_of_spades': 'интересное предложение',
     'spades': 'разрешение проблем, улучшение здоровья близкого человека'},

    {'name': 'king_of_hearts',
     'title': 'Приятный блондин (для дамы - муж, для мужчины - покровитель)',
     'meaning': 'Король Черви',
     'suit': 'hearts',
     'qween_of_hearts': 'мечтает о свадьбе',
     'hearts': 'любящий, доверчивый', 
     'clubs': 'щедрый',
     'qween_of_diamonds': 'интриги на него не повлияют',
     'diamonds': 'влиятельный покровитель',
     'spades': 'помогает, даёт полезные советы',},

    {'name': 'qween_of_hearts',
     'title': 'Приятная блондинка',
     'meaning': 'Дама Черви',
     'suit': 'hearts',
     'king_of_hearts': 'усиление страсти',
     'jack_of_hearts': 'легкий флирт',
     'hearts': 'она влюбчива и доверчива',
     'clubs': 'любит делать подарки',
     'diamonds': 'преданная сотрудница',
     'spades': 'утешительница Ваших тягот, но без особых успехов'},

    {'name': 'jack_of_hearts',
     'title': 'Приятный блондин (для дамы - поклонник, для мужчины - товарищ)',
     'meaning': 'Валет Черви',
     'suit': 'hearts',
     'qween_of_hearts': 'флирт может стать серьёзным',
     'hearts': 'верный друг', 
     'clubs': 'щедрый',
     'qween_of_diamonds': 'рискует попасть под влияние неискренной женщины',
     'diamonds': 'преданный сотрудник',
     'spades': 'утешитель',},

    {'name': 'ten_of_hearts', 'title': 'Дом,очаг',
     'meaning': 'Десятка Черви',
     'suit': 'hearts',
     'hearts': 'семейное согласие', 
     'clubs': 'большое материальное благополучие',
     'qween_of_diamonds': 'мнимая подруга, беспокойство',
     'diamonds': 'удовлетворение на работе',
     'ten_of_spades': 'счастливые перемены в семье',
     'spades': 'беспочвенное беспокойство о здоровье родственников'},

    {'name': 'nine_of_hearts', 'title': 'Разочарование',
     'meaning': 'Девятка Черви',
     'suit': 'hearts',
     'king_of_hearts': 'небольшое разочарование в любви',
     'qween_of_hearts': 'небольшое разочарование в любви',
     'jack_of_hearts': 'небольшое разочарование в любви',
     'hearts': 'неудача', 
     'clubs': 'разочарование из-за денег',
     'diamonds': 'умеренный успех в делах',
     'ace_of_spades': 'предложение не приведёт к успеху',
     'spades': 'препятствия в решении Ваших текущих проблем'},

    {'name': 'eight_of_hearts',
     'title': 'Небольшие радости',
     'meaning': 'Восьмёрка Черви',
     'suit': 'hearts',
     'king_of_hearts': 'небольшие успехи',
     'qween_of_hearts': 'небольшие успехи',
     'jack_of_hearts': 'небольшие успехи',
     'hearts': 'тихое счастье, дружба', 
     'clubs': 'приятный подарок',
     'ace_of_diamonds': 'письмо, радость',
     'eight_of_diamonds': 'приятный визит',
     'ten_of_diamonds': 'приятная поездка',
     'diamonds': 'удовлетворение работой',
     'spades': 'быстрое решение проблем на работе'},
    
    {'name': 'seven_of_hearts',
     'title': 'Ожидание блондина или блондинки',
     'meaning': 'Семёрка Черви',
     'suit': 'hearts',
     'hearts': 'ищет Вашей любви или дружбы', 
     'clubs': 'мечтает сделать Вам подарок',
     'ace_of_diamonds': 'напишет Вам страстное письмо',
     'eight_of_diamonds': 'нанесёт визит',
     'diamonds': 'беспокоится за Вас',
     'spades': 'сочувствует Вашим трудностям и хочет Вам помочь',},

# буби diamonds

    {'name': 'ace_of_diamonds',
     'title': 'Приятное письмо',
     'meaning': 'Туз Буби',
     'suit': 'diamonds',
     'qween_of_hearts': 'объяснение в любви',
     'jack_of_hearts': 'объяснение в любви',
     'hearts': 'новость от дорогого человека',
     'clubs': 'известие о подарке',
     'eight_of_diamonds': 'весть о визите',
     'ten_of_diamonds': 'весть о визите',
     'diamonds': 'хорошие новости',
     'ace_of_spades': 'интересные предложения',
     'spades': 'возможное урегулирование спора'},

    {'name': 'king_of_diamonds',
     'title': 'Друг, дальний родственник или военный',
     'meaning': 'Король Буби',
     'suit': 'diamonds',
     'hearts': 'несколько эгоистичен',
     'clubs': 'пришлет подарок',
     'qween_of_diamonds': 'коварная женщина рядом с ним',
     'diamonds': 'напишет или посетит',
     'eight_of_spades': 'страдает',
     'nine_of_spades': 'страдает',
     'spades': 'может помочь уладить Ваши семейные разногласия и ссоры'},

    {'name': 'qween_of_diamonds',
     'title': 'Женщина коварная или лёгкого поведения',
     'meaning': 'Дама Буби',
     'suit': 'diamonds',
     'king_of_hearts': 'попытки навредить провалятся',
     'jack_of_hearts': 'попытки навредить провалятся',
     'hearts': 'мнимого друга разоблачат',
     'clubs': 'ей не удастся выудить деньги',
     'diamonds': 'попытки навредить',
     'spades': 'её злословие обратиться против неё самой'},

    {'name': 'jack_of_diamonds', 'title': 'Посланец с хорошими вестями',
     'meaning': 'Валет Буби',
     'suit': 'diamonds',
     'hearts': 'приятные новости в семейных делах', 
     'clubs': 'деньги в подарок',
     'diamonds': 'хорошие новости о текущих делах',
     'ace_of_spades': 'интересное предложение',
     'spades': 'приятные новости о здоровье близких людей, родственников'},

    {'name': 'ten_of_diamonds', 'title': 'Поездки и предприятия',
     'meaning': 'Десятка Буби',
     'suit': 'diamonds',
     'qween_of_hearts': 'благополучная встреча',
     'jack_of_hearts': 'благополучная встреча',
     'hearts': 'поездка по сердечным делам или с близкими', 
     'clubs': 'удачная поездка',
     'diamonds': 'успешная деловая поездка',
     'spades': 'поездка по семейным делам решит проблемы и неприятности'},

    {'name': 'nine_of_diamonds', 'title': 'Задержки, препятствия, помехи',
     'meaning': 'Девятка Буби',
     'suit': 'diamonds',
     'king_of_hearts': 'задержка в решении сердечных проблем',
     'qween_of_hearts': 'задержка в решении сердечных проблем',
     'jack_of_hearts': 'задержка в решении сердечных проблем',
     'hearts': 'любовь встречает препятствия', 
     'clubs': 'запоздалый возврат денег',
     'diamonds': 'текущие дела будут отложены',
     'spades': 'помехи и задержки в решении текущих дел вызовут гнев'},

    {'name': 'eight_of_diamonds',
     'title': 'Близкая дорога, предприятия, визиты',
     'meaning': 'Восьмёрка Буби',
     'suit': 'diamonds',
     'qween_of_hearts': 'конфликтное любовное свидание',
     'jack_of_hearts': 'конфликтное любовное свидание',
     'hearts': 'визит отложен, неожиданное появление родных', 
     'clubs': 'расходы на поездку',
     'diamonds': 'безрезультатное предприятие',
     'eight_of_spades': 'томительный визит',
     'nine_of_spades': 'томительный визит',
     'spades': 'предприятие, не давшее заметного результата'},

    {'name': 'seven_of_diamonds',
     'title': 'Небольшие новости, разногласия, гнев',
     'meaning': 'Семёрка Буби',
     'suit': 'diamonds',
     'qween_of_hearts': 'ссора возлюбленных',
     'jack_of_hearts': 'ссора возлюбленных',
     'seven_of_hearts': 'удивление новорожденному',
     'hearts': 'ссора родных',
     'seven_of_clubs': 'расходы на новорожденного',
     'clubs': 'траты денег',
     'king_of_diamonds': 'гнев',
     'qween_of_diamonds': 'гнев на коварство женщины',
     'diamonds': 'разочарования на работе',
     'spades': 'споры'},

#  крести clubs
    {'name': 'ace_of_clubs', 'title': 'Быстрая и полная победа',
     'meaning': 'Туз Крести',
     'suit': 'clubs',
     'jack_of_hearts': 'триумф в соперничестве',
     'gween_of_hearts': 'триумф в соперничестве',
     'hearts': 'признание в семье',
     'clubs': 'триумф в финансовых делах',
     'diamonds': 'победа над конкурентами',
     'spades': 'полная победа над трудностями на работе или в сердечных делах'},

    {'name': 'king_of_clubs',
     'title': 'Серьёзный брюнет (для дамы  - муж, для мужчины - покровитель)',
     'meaning': 'Король Крести',
     'suit': 'clubs',
     'hearts': 'страдает в любви',
     'qween_of_clubs': 'трудности дома', 
     'clubs': 'временные финансовые трудности',
     'diamonds': 'он обманут',
     'qween_of_spades': 'рискует попасть под влияние интриганки',
     'eight_of_spades': 'поглощен своими заботами, нет времени на Ваши',
     'nine_of_spades': 'поглощен своими заботами, нет времени на Ваши',
     'spades': 'денежные проблемы решатся удачно'},

    {'name': 'qween_of_clubs',
     'title': 'Энергичная брюнетка',
     'meaning': 'Дама Крести',
     'suit': 'clubs',
     'hearts': 'любящая верная',
     'king_of_clubs': 'усиление страсти',
     'clubs': 'щедрая',
     'diamonds': 'преданная сотрудница',
     'spades': 'поможет выкарабкаться из любых неприятностей'},

    {'name': 'jack_of_clubs', 'title': 'Молодой и серьёзный брюнет',
     'meaning': 'Валет Крести (для женщины - воздыхатель, для мужчины - друг)',
     'suit': 'clubs',
     'hearts': 'верный друг', 'qween_of_clubs': 'мечтает о женитьбе',
     'clubs': 'щедрый с блестящим будущим',
     'qween_of_diamonds': 'рядом с ним коварная женщина',
     'diamonds': 'активный и серьезный сотрудник',
     'spades': 'опора в любых делах'},

    {'name': 'ten_of_clubs',
     'title': 'К получению большой суммы денег',
     'meaning': 'Десятка Крести',
     'suit': 'clubs',
     'hearts': 'подарок от дорогого человека',
     'clubs': 'большая сумма денег',
     'ten_of_diamonds': 'наследство или неожиданный дар',
     'diamonds': 'успех в делах',
     'ten_of_spades': 'скорое получение денег',
     'spades': 'крупное наследство или поступление большой суммы денег'},

    {'name': 'nine_of_clubs', 'title': 'К получению денег',
     'meaning': 'Девятка Крести',
     'suit': 'clubs',
     'qween_of_hearts': 'крупные подарки от близких',
     'jack_of_hearts': 'крупные подарки от близких',
     'hearts': 'большоя выручка от продажи', 
     'clubs': 'возвращение Вам долгов',
     'ace_of_diamonds': 'письмо или деньги',
     'ten_of_diamonds': 'небольшое наследство или подарок',
     'diamonds': 'успех в делах',
     'ten_of_spades': 'немедленный возврат Вам долга',
     'spades': 'небольшое наследство, деньги'},

    {'name': 'eight_of_clubs',
     'title': 'К получению подарков, небольших сумм денег',
     'meaning': 'Восьмёрка Крести',
     'suit': 'clubs',
     'king_of_hearts': 'дорогие украшения в знак любви',
     'qween_of_hearts': 'дорогие украшения в знак любви',
     'jack_of_hearts': 'дорогие украшения в знак любви',
     'hearts': 'подарок членам семьи',
     'clubs': 'получение денег',
     'king_of_diamonds': 'подарок издалека',
     'ten_of_diamonds': 'подарок издалека',
     'diamonds': 'подарок на работе',
     'spades': 'подарок в знак примирения'},

     {'name': 'seven_of_clubs',
     'title': 'Ожидание брюнета или брюнетки',
     'meaning': 'Семёрка Крести',
     'suit': 'clubs',
     'hearts': 'его чувство - какой-то скрытый интерес', 
     'clubs': 'нуждается в деньгах',
     'ace_of_diamonds': 'посещение или письмо, выгода',
     'eight_of_diamonds': 'посещение или письмо, выгода',
     'diamonds': 'хочет использовать Ваше влияние',
     'spades': 'печален и зол из-за Вашего невнимания к его чувствам',},

# пики spades

    {'name': 'ace_of_spades', 'title': 'Предложение',
     'meaning': 'Туз Пики',
     'suit': 'spades',
     'gween_of_hearts': 'объяснение в любви',
     'jack_of_hearts': 'объяснение в любви',
     'hearts': 'новая дружба',
     'clubs': 'интересное предложение, прибыль',
     'diamonds': 'интересное предложение на работе',
     'spades': 'выгодные сделки на работе, разрешение проблем дома'},

    {'name': 'king_of_spades', 'title': 'Казённый человек, советник, вдовец',
     'meaning': 'Король Пики',
     'suit': 'spades',
     'hearts': 'полезен в сердечных делах',
     'ace_of_clubs': 'поможет выйграть тяжбу',
     'clubs': 'совет в денежных делах',
     'diamonds': 'поддержка в работе',
     'qween_of_spades': 'хочет снова жениться',
     'spades': 'серьёзная поддержка в любом Вашем начинании'},

    {'name': 'qween_of_spades',
     'title': 'Вдова, разведённая или одинокая женщина',
     'meaning': 'Дама Пики',
     'suit': 'spades',
     'hearts': 'попытка посорить друзей провалится', 
     'clubs': 'её состояние улучшится',
     'diamonds': 'тщетно пытается навредить',
     'jack_of_spades': 'заговор не увенчается успехом',
     'spades': 'она на пути к выздоровлению',},

    {'name': 'jack_of_spades', 'title': 'Злой человек, лжец, предатель',
     'meaning': 'Валет Пики',
     'suit': 'spades',
     'hearts': 'бессовестный соблазнитель', 
     'clubs': 'пытается обмануть',
     'diamonds': 'беспринципный конкурент',
     'qween_of_spades': 'измена в близком окружении',
     'jack_of_spades': 'бессовестный подчинённый',
     'spades': 'плут, ищущий повод навредить и свести счёты'},

     {'name': 'ten_of_spades', 'title': 'Немедленные результаты',
     'meaning': 'Десятка Пики',
     'suit': 'spades',
     'hearts': 'счастливое решение семейных проблем', 
     'clubs': 'нежданное разрешение финансовых проблем',
     'ace_of_diamonds': 'неожиданное письмо',
     'eight_of_diamonds': 'скорые поездки',
     'ten_of_diamonds': 'скорые поездки',
     'diamonds': 'исполнение желаний',
     'spades': 'быстрое выздоровление близкого Вам человека'},

    {'name': 'nine_of_spades', 'title': 'Тревоги, печали',
     'meaning': 'Девятка Пики',
     'suit': 'spades',
     'king_of_hearts': 'печаль из-за любви',
     'qween_of_hearts': 'печаль из-за любви',
     'jack_of_hearts': 'печаль из-за любви',
     'hearts': 'трудности дома', 
     'clubs': 'финансовые трудности',
     'diamonds': 'текущие проблемы',
     'qween_of_spades': 'измена, печаль',
     'jack_of_spades': 'измена, печаль',
     'eight_of_spades': 'болезнь близкого',
     'spades': 'житейские трудности и неприятности в семье'},

    {'name': 'eight_of_spades',
     'title': 'Мелкие печали, слёзы',
     'meaning': 'Восьмёрка Пики',
     'suit': 'spades',
     'seven_of_hearts': 'беспокоит светловолосый ребёнок', 
     'hearts': 'печаль о дорогих людях',
     'seven_of_clubs': 'заботы о темноволосом ребёнке',
     'clubs': 'денежные затруднения',
     'qween_of_diamonds': 'стычка с соперником',
     'diamonds': 'задержка в решении денежных вопросов',
     'spades': 'недолгая болезнь'},

    {'name': 'seven_of_spades',
     'title': 'Меланхолия, мелкие заботы',
     'meaning': 'Семёрка Пики',
     'suit': 'spades',
     'hearts': 'разочарование в сердечных делах', 
     'clubs': 'потеря денег или вещей',
     'eight_of_diamonds': 'помехи и отмена поездки',
     'ten_of_diamonds': 'помехи и отмена поездки',
     'diamonds': 'деловые и материальные хлопоты',
     'qween_of_spades': 'мелкая измена друзей',
     'jack_of_spades': 'мелкая измена друзей',
     'spades': 'мелкие проблемы, недоразумения и прочие неприятности'},
]
